##### Importing libraries

In [2]:
import pandas as pd
import numpy as np

##### Series object

In [4]:
data = pd.Series([2.5,1,5.6,3.4,2])#A Pandas Series is a one-dimensional array of indexed data.
data

0    2.5
1    1.0
2    5.6
3    3.4
4    2.0
dtype: float64

In [5]:
data.values#getting the values of a series

array([2.5, 1. , 5.6, 3.4, 2. ])

In [6]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
data[1]

1.0

In [9]:
data[1:3]

1    1.0
2    5.6
dtype: float64

In [11]:
data = pd.Series([2.5,1,5.6,3.4,2],index=['a','b','c','d','e'])#personnalised index
data

a    2.5
b    1.0
c    5.6
d    3.4
e    2.0
dtype: float64

##### Series as specialised dictionary

In [12]:
population_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [13]:
population['Texas']

26448193

In [14]:
population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

#### DataFrame Objects

##### DataFrame as generalised Numpy arry

In [15]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [16]:
states = pd.DataFrame({'population':population,'area':area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [17]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [18]:
states.columns

Index(['population', 'area'], dtype='object')

In [19]:
random = pd.DataFrame(np.random.rand(3, 2),columns=['foo', 'bar'],index=['a', 'b', 'c'])#creating a random data
random

        foo       bar
a  0.724997  0.710100
b  0.576598  0.606375
c  0.477067  0.181355

#### Selection

In [21]:
random['foo']

a    0.724997
b    0.576598
c    0.477067
Name: foo, dtype: float64

In [23]:
random['a':'b']#slicing by explicit index

        foo       bar
a  0.724997  0.710100
b  0.576598  0.606375

In [26]:
random.keys()

Index(['foo', 'bar'], dtype='object')

In [27]:
random[0:2]#slicing by implicit integer

        foo       bar
a  0.724997  0.710100
b  0.576598  0.606375

In [29]:
sliced = random[(random > 0.3)&(random < 0.7)]#masking
sliced

        foo       bar
a       NaN       NaN
b  0.576598  0.606375
c  0.477067       NaN

##### Indexer loc, iloc, and ix

######  loc attribute allows indexing and slicing that always reference the explicit index

##### iloc attribute allows indexing and slicing that always reference the implicit python-style index

#### Slicing in DataFrame

In [33]:
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [34]:
states.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [35]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [36]:
states.area is states['area']# however is advisable to use the second 
#since the first won't work in case of two or more words

True

In [40]:
states['density'] = states['population'] / states['area']#adding new column
states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [41]:
new_states = states.T #interchanging rows and columns

,California,Texas,New York,Florida,Illinois
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [42]:
new_states.values #get array of its content

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481930e+07, 6.95662000e+05, 3.80187404e+01],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02],
       [1.95528600e+07, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.49995000e+05, 8.58837628e+01]])

In [44]:
new_states.values[0] # get an array of its first column

array([3.83325210e+07, 4.23967000e+05, 9.04139261e+01])

In [45]:
states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [46]:
states.iloc[:3,:2]

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

In [48]:
states.loc[:'New York',:'area']

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

In [51]:
states.loc[states.density > 100, ['population','area']]# population and area of those with density greater than 100

          population    area
New York    19651127  141297
Florida     19552860  170312

In [52]:
states.loc[states.density > 100, ['population','area','density']]#we can as well augment the column needed

          population    area     density
New York    19651127  141297  139.076746
Florida     19552860  170312  114.806121

In [54]:
states.loc[states.density > 100] #in case we need all the row

          population    area     density
New York    19651127  141297  139.076746
Florida     19552860  170312  114.806121

In [53]:
states.iloc[0,2]= 90 #changing values
states

            population    area     density
California    38332521  423967   90.000000
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

##### Index alignment in DataFrame

In [17]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)),
columns=list('AB'), index=list('12'))
A

    A   B
1  15  13
2   8  11

In [20]:
A.stack()

1  A    15
   B    13
2  A     8
   B    11
dtype: int32

In [23]:
A.stack().mean()

11.75

In [15]:
B = pd.DataFrame(np.random.randint(0, 10, (3, 3)),
columns=list('BAC'),index=('123'))
B

   B  A  C
1  5  7  7
2  0  8  8
3  6  1  1

In [18]:
A + B #Notice that indices are aligned correctly irrespective of their order in the two objects,
#and indices in the result are sorted.

      A     B   C
1  22.0  18.0 NaN
2  16.0  11.0 NaN
3   NaN   NaN NaN

In [19]:
#As was the case with Series, we can use the associated
#object’s arithmetic method and pass any desired fill_value to be used in place
#of missing entries. Here we’ll fill with the mean of all values in A (which we compute
#by first stacking the rows of A):
fill = A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
1  22.00  18.00  18.75
2  16.00  11.00  19.75
3  12.75  17.75  12.75

In [ ]:
"""python  pandas
+       add()
-       sub(), subtract()
*       mul(), multiply()
/       truediv(), div(), divide()
//      floordiv()
%       mod()
**      pow()"""

##### Ufuncs: Operations Between DataFrame and Series

In [27]:
A = np.random.randint(10, size=(3, 4))#in numpy
A

array([[8, 4, 9, 9],
       [0, 3, 3, 4],
       [9, 6, 2, 7]])

In [28]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-8, -1, -6, -5],
       [ 1,  2, -7, -2]])

In [29]:
df = pd.DataFrame(A, columns=list('QRST'))#in pandas
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -8 -1 -6 -5
2  1  2 -7 -2

In [30]:
#If you would instead like to operate column-wise, you can use the object methods
#mentioned earlier, while specifying the axis keyword:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  4  0  5  5
1 -3  0  0  1
2  3  0 -4  1

In [31]:
#Note that these DataFrame/Series operations, like the operations discussed before,
#will automatically align indices between the two elements:
halfrow = df.iloc[0, ::2]
halfrow

Q    8
S    9
Name: 0, dtype: int32

In [32]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -8.0 NaN -6.0 NaN
2  1.0 NaN -7.0 NaN

##### NaN and None in Pandas

In [33]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [ ]:
"""
Typeclass   Conversion when storing NAs      NA sentinel value
floating    No change                         np.nan
object      No change                         None or np.nan
integer     Cast to float64                   np.nan
boolean     Cast to object                    None or np.nan"""

##### Operating on Null Values

In [ ]:
#isnull()
#Generate a Boolean mask indicating missing values
#notnull()
#Opposite of isnull()
#dropna()
#Return a filtered version of the data
#fillna()
#Return a copy of the data with missing values filled or imputed

##### Detecting null values

In [34]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

##### Dropping null values

In [35]:
data.dropna()

0        1
2    hello
dtype: object

In [38]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [37]:
#By default, dropna() will drop all rows in which any null value is present
df.dropna()

     0    1  2
1  2.0  3.0  5

In [39]:
#Alternatively, you can drop NA values along a different axis; axis=1 drops all columns
#containing a null value:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [40]:
"""
But this drops some good data as well; you might rather be interested in dropping
rows or columns with all NA values, or a majority of NA values. This can be specified
through the how or thresh parameters, which allow fine control of the number of
nulls to allow through.
The default is how='any', such that any row or column (depending on the axis keyword)
containing a null value will be dropped. You can also specify how='all', which
will only drop rows/columns that are all null values:"""

df[3] = np.nan #adding a column
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [41]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [42]:
df.dropna(axis='columns', how='any')

   2
0  2
1  5
2  6

In [45]:
#or finer-grained control, the thresh parameter lets you specify a minimum number
#of non-null values for the row/column to be kept:

df.dropna(axis='rows', thresh=3)

#Here the first and last row have been dropped, because they contain only two nonnull
#values.

     0    1  2   3
1  2.0  3.0  5 NaN

##### Filling null values

In [46]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [47]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [48]:
#We can specify a forward-fill to propagate the previous value forward:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [49]:
#Or we can specify a back-fill to propagate the next values backward:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [50]:
#For DataFrames, the options are similar, but we can also specify an axis along which
#the fills take place
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [53]:
df1 = df.fillna(method='ffill', axis=1)
df1
#Notice that if a previous value is not available during a forward fill, 
#the NA value remains.

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [54]:
#we can use backword fill to complete it
df2 = df1.fillna(method='bfill', axis=1)
df2

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  4.0  4.0  6.0  6.0

##### Methods of MultiIndex Creation

In [55]:
df = pd.DataFrame(np.random.rand(4, 2),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=['data1', 'data2'])
df

        data1     data2
a 1  0.244875  0.397818
  2  0.468778  0.369620
b 1  0.040921  0.033474
  2  0.543624  0.988469

In [64]:
#Similarly, if you pass a dictionary with appropriate tuples as keys, Pandas will automatically
#recognize this and use a MultiIndex by default:
data = {
('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York',2010): 19378102}
pop = pd.Series(data)
pop

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

##### MultiIndex for columns

In [57]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  39.5  38.0  39.3  36.0  35.8
     2      32.0  37.3  38.0  36.3  34.0  36.4
2014 1      22.0  38.5  45.0  36.7  49.0  37.6
     2      20.0  37.3  33.0  37.7  36.0  36.1

##### Indexing and Slicing a MultiIndex

In [65]:
pop

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [68]:
pop['California',2000]

33871648

In [69]:
pop['California']

2000    33871648
2010    37253956
dtype: int64

In [70]:
pop[:, 2000]

California    33871648
Texas         20851820
New York      18976457
dtype: int64

In [72]:
pop[pop > 22000000]

California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [75]:
pop[['California', 'Texas']]

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [76]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      31.0  39.5  38.0  39.3  36.0  35.8
     2      32.0  37.3  38.0  36.3  34.0  36.4
2014 1      22.0  38.5  45.0  36.7  49.0  37.6
     2      20.0  37.3  33.0  37.7  36.0  36.1

In [77]:
health_data['Guido', 'HR']

year  visit
2013  1        38.0
      2        38.0
2014  1        45.0
      2        33.0
Name: (Guido, HR), dtype: float64

In [78]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      31.0  39.5
     2      32.0  37.3

In [79]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        31.0
      2        32.0
2014  1        22.0
      2        20.0
Name: (Bob, HR), dtype: float64

##### Index setting and resetting

In [82]:
pop_flat = pop.reset_index(name='population')
pop_flat

      level_0  level_1  population
0  California     2000    33871648
1  California     2010    37253956
2       Texas     2000    20851820
3       Texas     2010    25145561
4    New York     2000    18976457
5    New York     2010    19378102

##### Combining Datasets: Concat and Append

#### Simple Concatenation with pd.concat

In [ ]:
#Signature in Pandas v0.18
pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
keys=None, levels=None, names=None, verify_integrity=False,
copy=True)

In [85]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

#### One-to-one joins

In [90]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})
df1, df2

(  employee        group
 0      Bob   Accounting
 1     Jake  Engineering
 2     Lisa  Engineering
 3      Sue           HR,
   employee  hire_date
 0     Lisa       2004
 1      Bob       2008
 2     Jake       2012
 3      Sue       2014)

In [88]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### Many-to-one joins

In [91]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

#### Many-to-many joins

In [93]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
'Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux',
'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

#### Specification of the Merge Key

#### The on keyword

In [95]:
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### The left_on and right_on keywords

In [96]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [97]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

#### The left_index and right_index keywords

In [98]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
df1a, df2a

(                group
 employee
 Bob        Accounting
 Jake      Engineering
 Lisa      Engineering
 Sue                HR,
           hire_date
 employee
 Lisa           2004
 Bob            2008
 Jake           2012
 Sue            2014)

In [99]:
print(df1a); print(df2a);
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [100]:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

#### Specifying Set Arithmetic for Joins

In [3]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
'drink': ['wine', 'beer']},
columns=['name', 'drink'])
print(df6); print(df7); print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [4]:
#We can specify this explicitly using the how keyword, which defaults to 'inner':
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [5]:
#Other options for the how keyword are 'outer', 'left', and 'right'. An outer join
#returns a join over the union of the input columns, and fills in all missing values with NAs:
print(df6); print(df7); print(pd.merge(df6, df7, how='outer'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [6]:
#The left join and right join return join over the left entries and right entries, respectively.
print(df6); print(df7); print(pd.merge(df6, df7, how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [7]:
print(df6); print(df7); print(pd.merge(df6, df7, how='right'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

#### Aggregation and Grouping

#### sum(), mean(), median(), min(), and max(),

### GroupBy: Split, Apply, Combine

In [8]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [9]:
df.groupby('key')

In [10]:
#To produce a result, we can apply an aggregate to this DataFrameGroupBy object,
#which will perform the appropriate apply/combine steps to produce the desired result:

df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [11]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': range(6),
'data2': rng.randint(0, 10, 6)},
columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [13]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [14]:
df.groupby('key').aggregate({'data1': 'min','data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [15]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0